class Settings:
    nepali_days = {'format': {'abbreviated': {0: 'आइत', 1: 'सोम', 2: 'मङ्गल', 3: 'बुध', 4: 'बिहि', 5: 'शुक्र', 6: 'शनि'}, 
                            'narrow': {0: 'आ', 1: 'सो', 2: 'म', 3: 'बु', 4: 'बि', 5: 'शु', 6: 'श'}, 
                            'short': {0: 'आइत', 1: 'सोम', 2: 'मङ्गल', 3: 'बुध', 4: 'बिहि', 5: 'शुक्र', 6: 'शनि'}, 
                            'wide': {0: 'आइतबार', 1: 'सोमबार', 2: 'मङ्गलबार', 3: 'बुधबार', 4: 'बिहिबार', 5: 'शुक्रबार', 6: 'शनिबार'}}, 
                    'stand-alone': {'abbreviated': {0: 'आइत', 1: 'सोम', 2: 'मङ्गल', 3: 'बुध', 4: 'बिहि', 5: 'शुक्र', 6: 'शनि'}, 
                    'narrow': {0: 'आ', 1: 'सो', 2: 'म', 3: 'बु', 4: 'बि', 5: 'शु', 6: 'श'}, 
                    'short': {0: 'आइत', 1: 'सोम', 2: 'मङ्गल', 3: 'बुध', 4: 'बिहि', 5: 'शुक्र', 6: 'शनि'}, 
                    'wide': {0: 'आइतबार', 1: 'सोमबार', 2: 'मङ्गलबार', 3: 'बुधबार', 4: 'बिहिबार', 5: 'शुक्रबार', 6: 'शनिबार'}}}
    nepali_months = {'format': {'abbreviated': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}, 
                                'narrow': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}, 
                                'wide': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}}, 
                    'stand-alone': {'abbreviated': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}, 
                                    'narrow': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}, 
                                    'wide': {1: 'बैशाख', 2: 'जेठ', 3: 'असार', 4: 'साउन', 5: 'भदौ', 6: 'असोज', 7: 'कार्तिक', 8: 'मंसिर', 9: 'पौष', 10: 'माघ', 11: 'फाल्गुण', 12: 'चैत्र'}}}